Terraform Format and Style: success
Terraform Initialization: success
Terraform Validation: success
Terraform Plan: success

<details><summary>Show Plan</summary>

```

module.api_network_route.data.cloudfoundry_space.space: Reading...
module.logo_upload_bucket.data.cloudfoundry_service.s3: Reading...
module.logo_upload_bucket.data.cloudfoundry_space.space: Reading...
module.redis.data.cloudfoundry_space.space: Reading...
module.domain.data.cloudfoundry_domain.origin_url: Reading...
module.domain.data.cloudfoundry_service.external_domain: Reading...
module.domain.data.cloudfoundry_space.space: Reading...
module.redis.data.cloudfoundry_service.redis: Reading...
module.redis.data.cloudfoundry_service.redis: Read complete after 0s [id=045871d3-d9a8-4a9b-a844-00a067fab054]
module.domain.data.cloudfoundry_domain.origin_url: Read complete after 0s [id=9bd7f50c-8c53-4277-8839-9af17f8bca40]
module.domain.data.cloudfoundry_service.external_domain: Read complete after 0s [id=ef75a1d4-3d69-4deb-8704-626a36d02a93]
module.redis.data.cloudfoundry_space.space: Read complete after 0s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.redis.cloudfoundry_service_instance.redis: Refreshing state... [id=c3f1065e-aca4-45ba-9749-56391f028d44]
module.logo_upload_bucket.data.cloudfoundry_service.s3: Read complete after 0s [id=440ce9d9-b108-4bbe-80b4-08338f3cc25b]
module.api_network_route.data.cloudfoundry_space.space: Read complete after 0s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.api_network_route.data.cloudfoundry_app.source_app: Reading...
module.api_network_route.data.cloudfoundry_app.destination_app: Reading...
module.domain.data.cloudfoundry_space.space: Read complete after 0s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.domain.data.cloudfoundry_app.app: Reading...
module.logo_upload_bucket.data.cloudfoundry_space.space: Read complete after 0s [id=4447d89a-9735-4d82-94e1-dc07713aa460]
module.logo_upload_bucket.cloudfoundry_service_instance.bucket: Refreshing state... [id=9e4972b9-c75d-4a84-927f-de4ec17a30d3]
module.api_network_route.data.cloudfoundry_app.source_app: Read complete after 1s [id=976ab9e0-8729-4c15-96e0-2643ab938354]
module.api_network_route.data.cloudfoundry_app.destination_app: Read complete after 1s [id=f6215fcd-2784-455d-bb4c-29570c03d284]
module.domain.data.cloudfoundry_app.app: Read complete after 1s [id=976ab9e0-8729-4c15-96e0-2643ab938354]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api_network_route.cloudfoundry_network_policy.internal_route will be created
  + resource "cloudfoundry_network_policy" "internal_route" {
      + id = (known after apply)

      + policy {
          + destination_app = "f6215fcd-2784-455d-bb4c-29570c03d284"
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = "976ab9e0-8729-4c15-96e0-2643ab938354"
        }
    }

  # module.domain.cloudfoundry_route.origin_route will be created
  + resource "cloudfoundry_route" "origin_route" {
      + domain   = "9bd7f50c-8c53-4277-8839-9af17f8bca40"
      + endpoint = (known after apply)
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "4447d89a-9735-4d82-94e1-dc07713aa460"

      + target {
          + app  = "976ab9e0-8729-4c15-96e0-2643ab938354"
          + port = (known after apply)
        }
    }

  # module.domain.cloudfoundry_service_instance.external_domain_instance will be created
  + resource "cloudfoundry_service_instance" "external_domain_instance" {
      + id                             = (known after apply)
      + json_params                    = jsonencode(
            {
              + domains = "beta.notify.gov"
            }
        )
      + name                           = "notify-admin-domain-production"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "7c5ed2a5-6734-455f-b1b9-4eaa55f638b3"
      + space                          = "4447d89a-9735-4d82-94e1-dc07713aa460"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @rahearn, Action: `pull_request`*